#! /usr/bin/env python3
# -*- coding: utf-8 -*-
# ------------------------------------------------------------------------------
#+ Autor:  	Ran#
#+ Creado: 	2022/02/12 19:15:21.350520
#+ Editado:	2022/02/12 19:18:04.198999
# ------------------------------------------------------------------------------

'''
uteis
'''

# ------------------------------------------------------------------------------

from .proxy import Proxy

# ------------------------------------------------------------------------------

__nome__ = 'conexions'
__version__ = '1.3'
__autor__ = 'Ran#'
__creditos__ = 'Ran#'
__licenza__ = 'GPLv3'
__descricion__ = 'Módulo unificado de conexións web'
__ligazon__ = 'https://www.github.com/Ran-n/conexions'
__problemas__ = 'https://www.github.com/Ran-n/conexions/issues'

# ------------------------------------------------------------------------------
